public class Theory {
    /*
    ## LinkedList (пер.Связный список)

    * Структура данных, представляющая собой список, где каждый элемент указывает на следующий элемент.

    ##Сравнение с массивом

    [] [] [] ... []
    0  1  2      N

    + Быстрый доступ к элементу, засчет того, что все элементы массива расположены в памяти друг за другом.

    -Ограниченный размер, в случае переполнения массива, нужно создавать новый

    -Сложные операции для добавления/удаления элементов со сдвигами.

    *Связеый список

    [a|next]->[b|next]->[c|next)->null

    * Элемент списка(узел) - состоит из пары - значение узла, ссылка на следующий узел.

    +Неограниченный размер
    +Добавление/удаление элемента в конец/начало выполняется за одну операцию
    +Удаление из середины не требует "прохождения пути до этого элемента"

    По сути LinkedList - это поезд с вагонами.

    -В Java ArrayList все равно работает быстрее.



     */
}
