public class Therms {
    /*
    class A extends B - ключевое слово,показывает что класс B является потомком класса A.Весь код который был
    в классе B переносится в класс A (помимо конструктора)

    Потомок ВСЕГДА является частным случаем класса предка

    Модификатор protected - обеспечивает уровень доступа "защищенный". Таким образом, член класса или конструктор
    доступен в классах потомках

    Переопределение метода - механизм наследования, позволяющий для классов - потомков написать метод, имеющий
    сигнатуру метода класса-предка, но с другой реализацией.(название и параметры методы одни и те же,но реализация
    метода другая)

    * Восходящее преобразование  - возможность присвоить объектной переменной класса-предка ссылку на объект
    класса-потомка(неявное преобразование)

     */
}
