public class Theory {
    /*
    # Базы данных

    * Хранилище информации

    * Реляционный базы данных - базы даннах, основанные на таблицах, между которыми могут быть определенные отношения.

    * Таблица - набор столбцов, имеющих различный тип, и строк - конкретных значений этих столбцов.

    * Первичный ключ - это идентификатор строки. В рамках таблицы он всегда должен быть уникальным для каждой строки.

    * Внешний ключ - столбец, ссылающийся на столбец другой таблицы

    * База данных при правильном построении таблиц берет на себя задачу по сохранению консистентности (согласованности)
     данных.

     * Согласованность данных - это когда значение внешнего ключа, ссылается на точно существующий объект в таблице
     "родителя"

     * Базы данных предоставляют мощный механизм для получения и фильтрации данных - язык запросов SQL


     */
}
